app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Another article"], ["body", "This just a dummy body I create to fill-up space."], ["created_at", "2024-01-10 20:09:44.587346"], ["updated_at", "2024-01-10 20:09:44.587346"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "I am on Rails! Yesss"], ["updated_at", "2024-01-10 20:52:33.918430"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)